clipboard/app/controllers/api/v1/days_controller.rb

    def index
        # byebug
        days = Day.all
---
SELECT "days".* FROM "days"

    def show
        day = Day.find(:id => params[:id].to_i)
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]