clipboard/app/controllers/api/v1/lessons_controller.rb

SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_day
        @day = Day.find(params[:day_id])