clipboard/app/controllers/api/v1/lessons_controller.rb

    def index
            lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

    def create
        lesson = Lesson.new(lesson_params)
        if lesson.save
---
INSERT INTO "lessons" ("title", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ljgjlhgji"], ["start", "2021-04-27 04:50:00"], ["end", "2021-04-27 06:10:00"], ["created_at", "2021-04-29 16:43:09.329990"], ["updated_at", "2021-04-29 16:43:09.329990"]]

    def show
        lesson = @day.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."day_id" = ?  [["day_id", 1]]

    def destroy
        lesson = Lesson.find(params[:id])
        lesson.destroy
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 14]]